#pragma once

//*****************************************************************************************
// MT3用の描画クラス
// polygon3-4, polygonManager, light, 等を排除して
// zBufferやlightingの計算を排除したDrawerクラス
// 旧camera3Dが持っていたdraw関数を移行
//*****************************************************************************************

//-----------------------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------------------
#include <Novice.h>
#include <Camera3D.h>
#include <MyVector2.h>

////////////////////////////////////////////////////////////////////////////////////////////
// PrimitiveDrawer class
////////////////////////////////////////////////////////////////////////////////////////////
class PrimitiveDrawer {
public:

	//=========================================================================================
	// public methods
	//=========================================================================================

	//! @brief シングルトン設計
	static PrimitiveDrawer* GetInstance();

	//! @brief 描画するカメラの設定
	void SetCamera(Camera3D* camera) { camera_ = camera; }

	//! @brief v1からv2への線の描画
	//! 
	//! @param[in] w.. world座標
	void DrawLine(
		const Vector3f& w1, const Vector3f& w2, uint32_t color
	);

private:

	//=========================================================================================
	// private variables
	//=========================================================================================

	Camera3D* camera_ = nullptr;

	//=========================================================================================
	// private methods
	//=========================================================================================

	const Vector2f& ChangeScreenPos(const Vector3f& worldPos);
	const Vector2f& ChangeScreenPos(const Vector3f& loaclPos, const Matrix4x4& worldMatrix);

};
